pulsating-flow-over-flexible-flap-3d-case3/fluid-openfoam/system/fvSchemes
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}

ddtSchemes
{
    default         Euler;
}
gradSchemes
{
    default         Gauss linear;
    grad(U)         cellLimited Gauss linear 1;
}

divSchemes
{
    default         Gauss linear;
    div(phi,U)      Gauss limitedLinearV 1;
}

interpolationSchemes
{
    default linear;
}

laplacianSchemes
{
    default Gauss linear corrected;
}

snGradSchemes
{
    default corrected;
}
